; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	spectrograph0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph0)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument4 spectrograph0)
	(supports instrument4 image2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph0)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument6 thermograph1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star19)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(have_image Star5 image2)
	(have_image Star6 spectrograph0)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 image2)
	(have_image Star11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
	(have_image Star13 image2)
	(have_image Planet14 image2)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 image2)
	(have_image Phenomenon17 thermograph1)
	(have_image Planet18 image2)
	(have_image Star19 image2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 14
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 14
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
4. (turn_to satellite3 groundstation4 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 14
5. (calibrate satellite3 instrument6 groundstation4)
   added: (calibrated instrument6)
   goals met: 0 of 14
6. (turn_to satellite3 phenomenon15 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon15)
   goals met: 0 of 14
7. (take_image satellite3 phenomenon15 instrument6 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 14
8. (turn_to satellite3 phenomenon17 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 phenomenon17)
   goals met: 1 of 14
9. (take_image satellite3 phenomenon17 instrument6 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 2 of 14
10. (turn_to satellite3 phenomenon9 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon9)
   goals met: 2 of 14
11. (take_image satellite3 phenomenon9 instrument6 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 3 of 14
12. (turn_to satellite3 planet10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet10)
   goals met: 3 of 14
13. (take_image satellite3 planet10 instrument6 image2)
   added: (have_image planet10 image2)
   goals met: 4 of 14
14. (turn_to satellite3 planet14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet14)
   goals met: 4 of 14
15. (take_image satellite3 planet14 instrument6 image2)
   added: (have_image planet14 image2)
   goals met: 5 of 14
16. (turn_to satellite3 planet18 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet18)
   goals met: 5 of 14
17. (take_image satellite3 planet18 instrument6 image2)
   added: (have_image planet18 image2)
   goals met: 6 of 14
18. (turn_to satellite3 star13 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 star13)
   goals met: 6 of 14
19. (take_image satellite3 star13 instrument6 image2)
   added: (have_image star13 image2)
   goals met: 7 of 14
20. (turn_to satellite3 star16 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star16)
   goals met: 7 of 14
21. (take_image satellite3 star16 instrument6 image2)
   added: (have_image star16 image2)
   goals met: 8 of 14
22. (turn_to satellite3 star19 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star19)
   goals met: 8 of 14
23. (take_image satellite3 star19 instrument6 image2)
   added: (have_image star19 image2)
   goals met: 9 of 14
24. (turn_to satellite3 star5 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 star5)
   goals met: 9 of 14
25. (take_image satellite3 star5 instrument6 image2)
   added: (have_image star5 image2)
   goals met: 10 of 14
26. (turn_to satellite0 groundstation0 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation0)
   goals met: 10 of 14
27. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 10 of 14
28. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 10 of 14
29. (take_image satellite0 phenomenon12 instrument1 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 11 of 14
30. (turn_to satellite0 star11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star11)
   goals met: 11 of 14
31. (take_image satellite0 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 12 of 14
32. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 12 of 14
33. (take_image satellite0 star6 instrument1 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 13 of 14
34. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 13 of 14
35. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 14 of 14
